backend/controllers/ArquivoController.php

    protected function findModel($file) {
        if (($model = Arquivo::findOne(['arquivo' => $file])) !== null || ($model = Arquivo::findOne(['id' => $file])) !== null) {
---
SELECT * FROM `arquivo` WHERE `arquivo`='Arquivo1.pdf'