backend/controllers/BibliotecaController.php

    protected function findModel($id)
    {
        if (($model = Biblioteca::findOne(['id' => $id])) !== null) {
---
SELECT * FROM `biblioteca` WHERE `id`='1'