backend/controllers/SiteController.php

    public function actionGetMunicipios($id) {
        $limite = 7;
        if($id==1)
        {$limite=5;     }
        else if($id==3)
        {$limite=6;     }
        else if($id==16)
        {$limite=0;     }
        // Busca os primeiros 7 municípios (sem ordenação) da base de dados
        $municipios = Municipio::find()
                ->where(['provinciaID' => $id])
                ->limit($limite)
                ->all();

        // Ordena os 7 municípios obtidos em ordem alfabética
        usort($municipios, function ($a, $b) {
            return strcmp($a->nomeMunicipio, $b->nomeMunicipio);
        });

        // Inicializa a lista de municípios
        $municipios_list = [];

        // Adiciona os municípios à lista
        foreach ($municipios as $municipio) {
            $municipios_list[] = ['id' => $municipio->Id, 'nome' => $municipio->nomeMunicipio];
        }

        // Adiciona o município "Intermunicipal" como o oitavo elemento, caso ele exista
        $intermunicipal = Municipio::find()
                ->where(['nomeMunicipio' => 'Intermunicipal'])
                ->one();
---
SELECT * FROM `municipio` WHERE `nomeMunicipio`='Intermunicipal'

    public function actionGetEvents() {
        Yii::$app->response->format = Response::FORMAT_JSON;
        $entidadesSelecionadas = Yii::$app->request->get('entidades');
        $provinciasSelecionadas = Yii::$app->request->get('provincias');
        $municipiosSelecionados = Yii::$app->request->get('municipios'); // Novo filtro por município
        $areasSelecionadas = Yii::$app->request->get('areas');
        $events = \backend\models\Event::find()->all();
---
SELECT * FROM `event`