backend/controllers/SiteController.php

SELECT * FROM `provincia`
---
//        // Execute a consulta
//        $results = $query->all();

        $provincias = Provincia::find()->all();

SELECT * FROM `municipio` WHERE `provinciaID`='7' LIMIT 7
---
    public function actionGetMunicipios($id) {

        $limite = 10;
        if ($id == 2) {

            $limite = 7;
        }

        $municipios = Municipio::find()
                ->where(['provinciaID' => $id])
                ->limit($limite) // Limita o resultado a três municípios
                ->all();

SELECT * FROM `provincia`
---
    public function actionCalendario() {
        $entidadesSelecionadas = Yii::$app->request->get('entidades');
        $provinciasSelecionadas = Yii::$app->request->get('provincias');
        $areasSelecionadas = Yii::$app->request->get('areas');

        $provincias = Provincia::find()->all();

SELECT * FROM `provincia`
---
    public function actionAddEvents() {
        $provincias = Provincia::find()->all();

SELECT * FROM `event`
---
    public function actionGetEvents() {
        Yii::$app->response->format = Response::FORMAT_JSON;

        $entidadesSelecionadas = Yii::$app->request->get('entidades');
        $provinciasSelecionadas = Yii::$app->request->get('provincias');
        $areasSelecionadas = Yii::$app->request->get('areas');
        //$areasSelecionadas =["Água"];
        $events = \backend\models\Event::find()->all();

SELECT * FROM `event` WHERE `Id`='102'
SELECT `email` FROM `user` WHERE `nomeCompleto`='Abel Wamana'
DELETE FROM `event` WHERE `Id`=102
---
    public function actionDeleteEvent() {
        $id = Yii::$app->request->get('id');
        $model = Event::findOne($id);

        if ($model === null) {
            Yii::$app->session->setFlash('error', 'Evento não encontrado.');
            return $this->redirect(['site/calendario']);
        }
        $isAdmin = Yii::$app->user->isGuest ? false : Yii::$app->user->can("Permissão de Administrador");
        $nomeLogado = Yii::$app->user->identity->nomeCompleto;
        $emailLogado = Yii::$app->user->identity->email;
        $anfitriaoNome = $model->convocadoPor;
        $anfitriaoEmail = User::find()->select('email')
                ->where(['nomeCompleto' => $anfitriaoNome])
                ->scalar();
        $dateTimeString = $model->start;
        $dataevento = date('d-m-Y', strtotime($dateTimeString));
        $titulo = $model->summary; // Adicionado $titulo

        if ($isAdmin || ($nomeLogado == $model->convocadoPor)) {
            $participantesArray = explode(',', $model->participantes);

            if ($model->delete()) {

SELECT `nome` FROM `contacto` WHERE `email`='Por confirmar em breve'
---
                // Enviar notificações por email para os participantes
                foreach ($participantesArray as $email) {
                    // Consulta para encontrar o nome do contacto com o email atual
                    $nomeContacto = Contacto::find()
                            ->select('nome')
                            ->where(['email' => $email])
                            ->scalar(); // Retorna o nome do primeiro contacto encontrado ou null se não houver

SELECT * FROM `provincia` WHERE `Id`=2
---
    public function actionEditEvent($id) {
        $provincias = Provincia::find()->all();