backend/controllers/SiteController.php

    public function actionGetEvents() {
        Yii::$app->response->format = Response::FORMAT_JSON;

        $entidadesSelecionadas = Yii::$app->request->get('entidades');
        $provinciasSelecionadas = Yii::$app->request->get('provincias');
        $areasSelecionadas = Yii::$app->request->get('areas');
        //$areasSelecionadas =["Água"];
        $events = \backend\models\Event::find()->all();
---
SELECT * FROM `event`