backend/views/layouts/navbar.php

$publicadosCount = 0;
$pendentesCount = 0;

$notificacoesEventos = Notificacoes::find()
        ->where(['id_usuario' => Yii::$app->user->id, 'estado' => 0])
        ->all();
---
SELECT * FROM `notificacoes` WHERE (`id_usuario`=36) AND (`estado`=0)