backend/views/site/calendario.php

SELECT * FROM `contacto`
---
                        ], ['prompt' => 'Selecione a Entidade'])
                ?>
                <?= $form->field($eventModel, 'convocadoPor')->textInput(['value' => $nomeUsuario, 'readonly' => true]) ?>
                <?=
                $form->field($eventModel, 'participantes')->widget(Select2::classname(), [
                    'data' => ArrayHelper::map(Contacto::find()->all(), 'email', function ($model) {
                        return $model->nome . ' - ' . $model->instituicao;
                    }),
                    'options' => ['placeholder' => 'Selecione os participantes...', 'multiple' => true, 'id' => 'select-participantes'], 'showToggleAll' => true,
                    'pluginOptions' => [
                        'allowClear' => true,
                    ],
                ]);