backend/views/site/calendario.php

            // Adicione mais itens conforme necessário
    ];

    $municipios = \backend\models\Municipio::find()
    ->select(['nomeMunicipio', 'nomeMunicipio'])
    ->indexBy('nomeMunicipio')
    ->column();
---
SELECT `nomeMunicipio`, `municipio`.`nomeMunicipio` FROM `municipio`

                        ], ['prompt' => 'Selecione a Entidade'])
                ?>
                <?= $form->field($eventModel, 'convocadoPor')->textInput(['value' => $nomeUsuario, 'readonly' => true]) ?>
                <?=
                $form->field($eventModel, 'participantes')->widget(Select2::classname(), [
                    'data' => ArrayHelper::map(Contacto::find()->where(['<>', 'estado', 'Inactivo'])->all(), 'email', function ($model) {
                        return $model->nome . ' - ' . $model->instituicao;
                    }),
                    'options' => ['placeholder' => 'Selecione os participantes...', 'multiple' => true, 'id' => 'select-participantes'], 'showToggleAll' => true,
                    'pluginOptions' => [
                         'tags' => true, // Permite adicionar novos valores
                        'allowClear' => true,
                        'tokenSeparators' => [','], // Permite separadores para múltiplos valores
                    ],
                ]);
---
SELECT * FROM `contacto` WHERE `estado` <> 'Inactivo'