backend/views/site/index.php

$metaaPartiFormAgri = Meta::find()->where(['nomeMeta' => 'participantes formacao apoio agricultores'])->one()->valorMeta;
$metaaApoioFamilias = Meta::find()->where(['nomeMeta' => 'participantes formacao apoio familias'])->one()->valorMeta;
$metaBenTransSoci = Meta::find()->where(['nomeMeta' => 'beneficiarios de transferencias sociais'])->one()->valorMeta;
$metaInfraestrutura = Meta::find()->where(['nomeMeta' => 'pequenas infra-estruturas'])->one()->valorMeta;
---
SELECT * FROM `meta` WHERE `nomeMeta`='ECA'

    function drawStackedBarChart() {
        var data = google.visualization.arrayToDataTable([
            ['Sexo', 'Masculino', 'Feminino'],
            ['', <?php echo 1111111 ?>, <?php echo 111111111111 ?>]
        ]);

        var options = {
            width: 400,
            height: 50,
            legend: {position: 'top', maxLines: 1},
            isStacked: true,
            colors: ['#B8CFFF', '#2970FF']

        };
        var chart = new google.visualization.BarChart(document.getElementById('stacked-bar-chartGados'));
        chart.draw(data, options);
    }
</script>
<?php
// Consulte as províncias da tabela "provincia"
$provincias = Provincia::find()->all();
$municipios = Municipio::find()->all();
$localidades = Localidade::find()->all();
---
SELECT * FROM `provincia`
SELECT * FROM `municipio`
SELECT * FROM `localidade`