backend/views/site/resultadosagricultura.php

SELECT * FROM `meta` WHERE `nomeMeta`='ECA'
SELECT * FROM `meta` WHERE `nomeMeta`='camponeses apoiados'
SELECT * FROM `meta` WHERE `nomeMeta`='participantes formacao apoio agricultores'
SELECT * FROM `meta` WHERE `nomeMeta`='participantes formacao apoio familias'
SELECT * FROM `meta` WHERE `nomeMeta`='beneficiarios de transferencias sociais'
SELECT * FROM `meta` WHERE `nomeMeta`='pequenas infra-estruturas'
---
}


$metaECA = Meta::find()->where(['nomeMeta' => 'ECA'])->one()->valorMeta;
$metacamponesesApoiados = Meta::find()->where(['nomeMeta' => 'camponeses apoiados'])->one()->valorMeta;
$metaaPartiFormAgri = Meta::find()->where(['nomeMeta' => 'participantes formacao apoio agricultores'])->one()->valorMeta;
$metaaApoioFamilias = Meta::find()->where(['nomeMeta' => 'participantes formacao apoio familias'])->one()->valorMeta;
$metaBenTransSoci = Meta::find()->where(['nomeMeta' => 'beneficiarios de transferencias sociais'])->one()->valorMeta;
$metaInfraestrutura = Meta::find()->where(['nomeMeta' => 'pequenas infra-estruturas'])->one()->valorMeta;