backend/models/BibliotecaSearch.php

SELECT DISTINCT `tipo` FROM `biblioteca` ORDER BY `tipo`
---
    public function getTipoOptions()
{
    $tipos = Biblioteca::find()
        ->select('tipo')
        ->distinct()
        ->orderBy('tipo')
        ->asArray()
        ->all();

SELECT DISTINCT `organizacao` FROM `biblioteca` ORDER BY `organizacao`
---
public function getOrganizacaoOptions()
{
    $organizacoes = Biblioteca::find()
        ->select('organizacao')
        ->distinct()
        ->orderBy('organizacao')
        ->asArray()
        ->all();

SELECT DISTINCT `anoConcluido` FROM `biblioteca` ORDER BY `anoConcluido`
---
public function getAnoOptions()
{
    $anos = Biblioteca::find()
        ->select('anoConcluido')
        ->distinct()
        ->orderBy('anoConcluido')
        ->asArray()
        ->all();

SELECT DISTINCT `estado` FROM `biblioteca` ORDER BY `estado`
---
public function getEstadoOptions()
{
    $estados = Biblioteca::find()
        ->select('estado')
        ->distinct()
        ->orderBy('estado')
        ->asArray()
        ->all();