backend/views/contacto/_form.php

/** @var backend\models\Contacto $model */
/** @var yii\widgets\ActiveForm $form */

 $provincias = Provincia::find()->all();
---
SELECT * FROM `provincia`